**** 2.2.3 工作原理
    cat命令不仅可以读取文件并拼接数据,它还能够从标准输入中
  进行读取.
    要从标准输入中读取,就要使用管道操作符:
    #+begin_src bash
      OUTPUT_FROM_SOME COMMANDS | cat
    #+end_src
    类似的,我们可以用cat将输入文件的内容与标准输入拼接在一起.
  方法如下:
  #+begin_src bash
    # 代码中的-被作为来自stdin文本的文件名
    echo "Text through stdin" | cat - file.txt
  #+end_src

  #+RESULTS:
  | Text | through | stdin |        |        |          |          |
  | This | is      | a     | line   | inside | file.txt |          |
  | This | is      | the   | second | line   | inside   | file.txt |

**** 2.4.3.补充内容
    find命令的一些其它选项.
    1. 根据文件名或正则表达式匹配搜索
       选项-name的参数制定了文件名所必须匹配的字符串.
       我们可以将通配符作为参数使用.
       *.txt能够匹配所有以.txt结尾的文件名.
       选项-print在终端中打印出符合条件的文件名或文件路径.
       #+begin_src bash
	 find /home/dream/record/emacs/ -name "*.txt" -print
       #+end_src
       find命令有一个选项-iname(忽略字母大小写)
       #+begin_src bash
	 find . -iname "example.txt" -print
       #+end_src

       如果想匹配多个条件中的一个,可以采用or条件操作:
       #+begin_src bash
	 # 注意前后括号的后前空格,没有空格会报错.
	 find . \( -name "*.txt" -o -name "*.sh" \) -print
       #+end_src


       选项-path的参数可以使用通配符来匹配文件路径或文件.
       -name总是用给定的文件名进行匹配.
       -path则将文件路径作为一个整体进行匹配.
       #+begin_src bash
	 find /home/dream/record/ -path "*emacs" -print
       #+end_src

       选项-regex的参数和-path类似,只是-regex是基于正则
     表达式来匹配文件路径的.
     #+begin_src bash
       # 类似的还有-iregex
       find . -regex ".*\(\.py\|\.sh\)"
     #+end_src

    2. 否定参数
       find也可以用"!"否定参数的含义
       #+begin_src bash
	 find . ! -name "*.txt" -print
       #+end_src

    3. 基于目录深度的搜索
       find命令在使用时会遍历所有子目录.我们可以采用一些深度
       参数来限制find命令遍历的深度.-maxdepth和-mindepth就是
       这类参数.
       我们只需要再当前目录中进行查找,深度可以设置为1;
       当需要向下两级时,深度可以设置为2;
       #+begin_src bash
	 # 将最大深度限制为1
	 # 该目录只列出当前目录下的所有普通文件.
	 find . -maxdepth 1 -type f -print
       #+end_src

       打印出深度距离当前目录至少两个子目录的所有文件
       #+begin_src bash
	 find /home/dream/exercise/ -mindepth 2 -type f -print
	 # find . -mindepth 2 -type f -print
	 # find . mindepth 2 -type f -print
       #+end_src

    4. 根据文件类型搜索
       -type可以对文件搜索进行过滤,借助这个选项,我们可以为find
       命令指明特定的文件匹配类型.
       只列出所有的目录
       #+begin_src bash
	 find . -type d -print
       #+end_src

       #+RESULTS:
       | .      |
       | ./test |

       只列出普通文件
       #+begin_src bash
	 find . -type f -print
       #+end_src

       只列出符号链接
       #+begin_src bash
	 find . -type l -print
       #+end_src

       #+RESULTS:
       : ./passwd

       type参数来匹配所需要的文件类型
       #+caption: 文件类型所对应的类型参数
	|----------+----------|
	| 文件类型 | 类型参数 |
	|----------+----------|
	| 普通文件 | f        |
	|----------+----------|
	| 符号链接 | l        |
	|----------+----------|
	| 目录     | d        |
	|----------+----------|
	| 字符设备 | c        |
	|----------+----------|
	| 块设备   | b        |
	|----------+----------|
	| 套接字   | s        |
	|----------+----------|
	| Fifo     | p        |
	|----------+----------|

    5. 根据文件时间进行搜索
       UNIX/Linux文件系统中的每个文件都有三种时间戳,如下所示:
       - 访问时间(-atime):用户最近一次访问文件的时间

       - 修改时间(-mtime):文件内容最后一次被修改的时间

       - 变化时间(-ctime):文件元数据(metadata,例如权限或所有权)
	 最后一次改变的时间.

       -atime,-mtime,-ctime可以作为find的时间参数.它们可以整数值
       给出,单位是天.这些整数值通常还带有-或+:-表示小于,+表示大于.
	 - 打印出在最近七天内被访问过的所有文件
	     #+begin_src bash
	     find . -type f -atime -7 -print
	     #+end_src

	 - 打印出恰好在七天前被访问过的所有文件
	     #+begin_src bash
	     find . -type f -atime 7 -print
	     #+end_src

	 - 打印出访问时间超过七天的所有文件
	    #+begin_src bash
	    find . -type f -atime +7 -print
	    #+end_src

	 find另一个漂亮的特性是-newer参数.使用-newer,我们可以指定一个
	 用于比较时间戳的参考文件,然后找出比参考文件更新的(更长的修改
	 时间)所有文件.
	 #+begin_src bash
	   find . -type f -newer sleep.sh -print
	 #+end_src

	 find命令的时间戳操作处理选项对编写系统备份和维护脚本很有帮助.

    6. 基于文件大小的搜索
       #+begin_src bash
	 # 大于2kb的文件
	 find . -type f -size +2k
       #+end_src

       #+begin_src bash
	 # 小于2kb的文件
	 find . -type f -size -2k
       #+end_src

       #+begin_src bash
	 # 等于2kb的文件
	 find . -type f -size 2k
       #+end_src

       除了k之外,还可以用其他文件大小单元.
       - b----块(512字节)

       - c----字节

       - w----字(2个字节)

       - k----千字节

       - M----兆字节

       - G----吉字节

    7. 删除匹配的文件
       -delete可以用来删除find查找到的匹配文件
       #+begin_src bash
	 find . -type f -name "*.swp" -delete
       #+end_src


    8. 基于文件权限和所有权的匹配
       文件匹配可以根据文件权限进行
       #+begin_src bash
	 find . -type f -perm 775 -print
       #+end_src

       可以根据文件的所有权进行搜索.
       用选项-user USER(参数USER既可以是用户名也可以是UID)
       就能够找出由某个特定用户所拥有的文件
       #+begin_src bash
	 find . -type f -user dream -print
       #+end_src

    9. 结合find执行命令或动作
       find命令可以借助选项-exec与其他命名进行结合.
       #+begin_src bash
	 find . -type f -user root -exec chown dream {} \; 
       #+end_src

       #+begin_src bash
	 # -exec之后可以接任何命令.{}表示一个匹配.对于任何一个匹配
	 # 文件名,{}会被该文件名替换.
	 find . -type f -name "*.sh" -exec cat {} \; > all_sh_files.txt
       #+end_src

       #+begin_src bash
	 # 将3天前的.txt文件复制到OLD目录中:
	 find . -mtime +3 -type f -name "*.txt" -exec cp {} ./OLD/ \;
       #+end_src

       -exec结合多个命令
       我们无法再-exec参数中直接使用多个命令.它只能够接受单个命令,不过
       我们可以耍个小花招.把多个命令写到一个shell脚本中(例如:command.sh)
       然后在-exec中使用这个脚本:
       #+begin_src bash
	 -exec ./commands.sh {} \;
       #+end_src

       -exec能够同print结合来生成有用的输出信息.例如:
       #+begin_src bash
	 find -type f -name "*.txt" -exec \
	 printf "Text file:%s\n" {} \;
       #+end_src


    10. 让find跳过特定的目录
	跳过.git目录
    #+begin_src bash
      find /home/dream/shell/ \( -name ".git" -prune \) \
      -o \( -type f -print \)
    #+end_src

